<template>
  <div class="user-agreement">
    <h1>Пользовательское соглашение</h1>
    <p>Дата вступления в силу: <strong>1 января 2023 года</strong>.</p>

    <h2>1. Введение</h2>
    <p>
      Настоящее пользовательское соглашение (далее - "Соглашение") регулирует порядок использования вами веб-сайта
      okna-haus.com и всех услуг, предоставляемых на нем. Используя наш Сайт, вы соглашаетесь с условиями
      данного Соглашения.
    </p>

    <h2>2. Определения</h2>
    <p>
      В настоящем Соглашении следующие термины имеют следующие значения:
    </p>
    <ul>
      <li><strong>Пользователь:</strong> любое физическое или юридическое лицо, использующее Сайт.</li>
      <li><strong>Услуги:</strong> все услуги, предоставляемые на Сайте.</li>
    </ul>

    <h2>3. Права и обязанности сторон</h2>
    <p>
      <strong>Права Пользователя:</strong>
    </p>
    <ul>
      <li>Иметь доступ к Сайту и использовать его услуги в соответствии с условиями данного Соглашения.</li>
      <li>Получать информацию о Сайте и услугах.</li>
    </ul>

    <p>
      <strong>Обязанности Пользователя:</strong>
    </p>
    <ul>
      <li>Соблюдать условия данного Соглашения.</li>
      <li>Не использовать Сайт для незаконных действий.</li>
    </ul>

    <p>
      <strong>Права Администрации Сайта:</strong>
    </p>
    <ul>
      <li>Изменять условия данного Соглашения в любое время без предварительного согласования с Пользователем.</li>
      <li>Приостанавливать или прекращать доступ к Сайту в случае нарушения Пользователем условий данного Соглашения.
      </li>
    </ul>

    <h2>4. Интеллектуальная собственность</h2>
    <p>
      Все материалы, размещенные на Сайте, являются объектами интеллектуальной собственности, охраняемыми
      законодательством. Использование любых материалов возможно только с разрешения правообладателя.
    </p>

    <h2>5. Ответственность сторон</h2>
    <p>
      Администрация Сайта не несет ответственности за любые убытки, возникшие в результате использования или
      невозможности использования Сайта и его услуг.
    </p>

    <h2>6. Заключительные положения</h2>
    <p>
      Данное Соглашение регулируется законодательством [вашей страны]. Все споры, возникающие в связи с данным
      Соглашением, подлежат разрешению в суде по месту нахождения Администрации Сайта.
    </p>
    <p>
      Если у вас есть вопросы по данному Соглашению, пожалуйста, свяжитесь с нами по адресу <a
        href="mailto:okna@haus.ru">okna@haus.ru</a>.
    </p>
  </div>
</template>

<script setup>
</script>

<style scoped>
.user-agreement {
  width: 1280px;
  margin: 0 auto;
  padding: 20px;
  font-family: Arial, sans-serif;
  line-height: 1.6;
}

h1 {
  text-align: center;
  font-size: 2.5em;
  margin-bottom: 20px;
}

h2 {
  font-size: 1.8em;
  margin-top: 20px;
  margin-bottom: 10px;
}

p {
  margin-bottom: 15px;
}

ul {
  margin: 10px 0 10px 20px;
}

li {
  margin-bottom: 5px;
}

a {
  color: #007BFF;
  text-decoration: none;
}

a:hover {
  text-decoration: underline;
}
</style>
