<template>
  <div class="privacy-policy">
    <h1>Политика конфиденциальности</h1>
    <p>Дата вступления в силу: <strong>1 января 2023 года</strong></p>

    <h2>1. Введение</h2>
    <p>
      Настоящая политика конфиденциальности описывает, как мы, [Название компании], собираем, используем, раскрываем и
      защищаем вашу информацию, когда вы используете наш веб-сайт okna-haus.com
    </p>
    <p>
      Мы придаем большое значение вашей конфиденциальности и стремимся защищать ваши персональные данные. Используя наш
      Сайт, вы соглашаетесь с условиями данной политики.
    </p>

    <h2>2. Собираемая информация</h2>
    <p>Мы можем собирать следующую информацию:</p>
    <ul>
      <li><strong>Личная информация:</strong> имя, адрес электронной почты, номер телефона, адрес и другая информация,
        которую вы предоставляете нам при регистрации или заполнении форм на сайте.
      </li>
      <li><strong>Данные об использовании:</strong> информация о том, как вы используете наш сайт, включая IP-адрес, тип
        браузера, время доступа, страницы, которые вы посещаете, и другие аналитические данные.
      </li>
      <li><strong>Файлы cookie:</strong> мы используем файлы cookie для улучшения пользовательского опыта на нашем
        сайте. Вы можете управлять настройками файлов cookie через настройки вашего браузера.
      </li>
    </ul>

    <h2>3. Использование информации</h2>
    <p>Мы используем вашу информацию для:</p>
    <ul>
      <li>Предоставления и улучшения нашего Сайта и услуг.</li>
      <li>Обработки ваших запросов и комментариев.</li>
      <li>Отправки уведомлений и обновлений, касающихся вашего аккаунта или услуг.</li>
      <li>Проведения исследований и анализа, чтобы лучше понять потребности пользователей.</li>
      <li>Защиты от мошенничества и обеспечения безопасности.</li>
    </ul>

    <h2>4. Раскрытие информации</h2>
    <p>Мы не передаем ваши личные данные третьим лицам, кроме следующих случаев:</p>
    <ul>
      <li>Услуги, предоставляемые третьими лицами: мы можем делиться вашей информацией с поставщиками услуг, которые
        помогают нам в работе нашего Сайта.
      </li>
      <li>Юридические требования: мы можем раскрывать вашу информацию, если это требуется по закону или в ответ на
        законные запросы государственных органов.
      </li>
      <li>Бизнес-передачи: в случае слияния, продажи активов или других трансакций ваша информация может быть передана
        новым владельцам.
      </li>
    </ul>

    <h2>5. Безопасность</h2>
    <p>
      Мы принимаем разумные меры для защиты вашей информации от потери, кражи и несанкционированного доступа. Однако
      стоит помнить, что ни один метод передачи данных через интернет или метод хранения данных не является на 100%
      безопасным.
    </p>

    <h2>6. Хранение информации</h2>
    <p>
      Мы храним вашу информацию только в течение того времени, которое необходимо для достижения целей, для которых она
      была собрана, или для выполнения юридических требований.
    </p>

    <h2>7. Ваши права</h2>
    <p>
      У вас есть право на доступ к вашим личным данным, их исправление или удаление. Вы можете также запросить
      ограничение обработки вашей информации или возражать против ее обработки. Для этого свяжитесь с нами по адресу,
      указанному ниже.
    </p>

    <h2>8. Изменения в политике конфиденциальности</h2>
    <p>
      Мы можем периодически обновлять эту политику. Все изменения будут опубликованы на этой странице с указанием даты
      вступления в силу. Мы рекомендуем вам периодически пересматривать политику для получения актуальной информации о
      нашей практике.
    </p>

    <h2>9. Связь с нами</h2>
    <p>
      Если у вас есть вопросы или комментарии по данной политике, пожалуйста, свяжитесь с нами по адресу <a
        href="mailto:okna@haus.ru">okna@haus.ru</a>.
    </p>
  </div>
</template>


<style scoped>
.privacy-policy {
 width: 1280px;
  margin: 0 auto;
  padding: 20px;
  font-family: Arial, sans-serif;
  line-height: 1.6;
}

h1 {
  text-align: center;

  font-size: 2.5em;
  margin-bottom: 20px;
}

h2 {

  font-size: 1.8em;
  margin-top: 20px;
  margin-bottom: 10px;
}

p {

  margin-bottom: 15px;
}

ul {
  margin: 10px 0 10px 20px;
}

li {
  margin-bottom: 5px;
}

a {
  color: #007BFF;
  text-decoration: none;
}

a:hover {
  text-decoration: underline;
}
</style>
